Revit 2027 API
ParameterDownloadOptions.SetGroupTypeId Method
 Set properties palette group identifier.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetGroupTypeId(
	ForgeTypeId groupTypeId
)
Public Sub SetGroupTypeId (
	groupTypeId As ForgeTypeId
)
public:
void SetGroupTypeId(
	ForgeTypeId^ groupTypeId
)
member SetGroupTypeId :
        groupTypeId : ForgeTypeId -> unit
Parameters
groupTypeId ForgeTypeId
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ParameterDownloadOptions Class
Autodesk.Revit.DB Namespace